In [1]:
import sqlite3 as sql
from sqlite3 import Error

def connect_db(path):
    conn = sql.connect(path)
    return conn

In [2]:
db_con = connect_db("C:\\Users\\Toffee\\Documents\\Coding\\SQL\\test2.db")
cur = db_con.cursor()

In [3]:
for row in cur.execute('SELECT * FROM contacts'):
    print (row)

(1, 'John', 'Doe', 'john.doe@testing.com', '+1234567890', 456465.0, '2001-02-10')
(2, 'Jane', 'Doe', 'jane.doe@testing.com', '+1234567894', 12345.0, '1995-05-22')
(4, 'Sarah', 'Doe', 'sarah.doe@testing.com', '+1234567892', 12345.0, '2012-03-12')
(5, 'Bob', 'Doe', 'bob.doe@testing.com', '+1234567891', 121231231.0, '2022-08-15')
(6, 'Ali', 'Mohammad', 'unassigned_@testing.com', '+123123132', 12123.0, '1899-05-24')

In [4]:
cur.execute("DELETE FROM contacts WHERE salary > 20000")
for row in cur.execute('SELECT * FROM contacts'):
    print (row)

(2, 'Jane', 'Doe', 'jane.doe@testing.com', '+1234567894', 12345.0, '1995-05-22')
(4, 'Sarah', 'Doe', 'sarah.doe@testing.com', '+1234567892', 12345.0, '2012-03-12')
(6, 'Ali', 'Mohammad', 'unassigned_@testing.com', '+123123132', 12123.0, '1899-05-24')

In [5]:
db_con.rollback()

In [6]:
for row in cur.execute('SELECT * FROM contacts'):
    print (row)

(1, 'John', 'Doe', 'john.doe@testing.com', '+1234567890', 456465.0, '2001-02-10')
(2, 'Jane', 'Doe', 'jane.doe@testing.com', '+1234567894', 12345.0, '1995-05-22')
(4, 'Sarah', 'Doe', 'sarah.doe@testing.com', '+1234567892', 12345.0, '2012-03-12')
(5, 'Bob', 'Doe', 'bob.doe@testing.com', '+1234567891', 121231231.0, '2022-08-15')
(6, 'Ali', 'Mohammad', 'unassigned_@testing.com', '+123123132', 12123.0, '1899-05-24')

In [7]:
import pandas as pd

In [8]:
pd.read_sql("SELECT * FROM contacts", db_con)

,contact_id,firstname,lastname,email,phone,salary,DoB
0,1,John,Doe,john.doe@testing.com,+1234567890,456465.0,2001-02-10
1,2,Jane,Doe,jane.doe@testing.com,+1234567894,12345.0,1995-05-22
2,4,Sarah,Doe,sarah.doe@testing.com,+1234567892,12345.0,2012-03-12
3,5,Bob,Doe,bob.doe@testing.com,+1234567891,121231231.0,2022-08-15
4,6,Ali,Mohammad,unassigned_@testing.com,+123123132,12123.0,1899-05-24